// Вычислить площадь круга

Console.WriteLine("Введите радиус круга: ");
int radius = int.Parse(Console.ReadLine());

Console.WriteLine("Площадь круга = " + Math.PI * Math.Pow(radius, 2));
